In [1]:
import requests
import json
import pandas as pd
from pyjstat import pyjstat

In [2]:
df_to_use = {'QLF01': [],
             'QLF03': [],
             'QLF05': [],
             'QLF07': [],
             'QLF08': [],
             'QLF18': [],
             'QLF20': [],
             'QLF21': [],
             'QLF25': [],
             'QLF26': [],
             'QLF32': [],
             'QLF33': [],
             'QLF34': [],
             'QLF35': [],
             'QLF36': [],
             'QLF47': [],
             'QLF48': [],
             'QLF49': [],
             'QES01': [],
             'QES03': [],
             'QES06': [],
             'QES07': [],
             'QES08': [],
             'QES11': [],
             'QES15': [],
             'QES20': [],
             'QES21': [],
             'QES22': [],
             'QES24': [],
             'QES25': []}

In [3]:
from src.etl import fetch_with_retry
# need to use fetch_with_retry here, cuz im writing this in a unstable 4g connection

for df in df_to_use:
    url_to_use = f"https://ws.cso.ie/public/api.restful/PxStat.Data.Cube_API.ReadDataset/{df}/JSON-stat/2.0/en"
    
    dataset = fetch_with_retry(url_to_use)
    df_to_use[df] = dataset.write('dataframe')

   #print(f'This is the {df_to_use[df]} table')
    display(df_to_use[df].head())
    print('----------------------------')

,Statistic,Quarter,Sex,ILO Economic Status,value
0,Persons aged 15 years and over,1998Q1,Both sexes,All ILO economic status,2857.2
1,Persons aged 15 years and over,1998Q1,Both sexes,In labour force,1699.0
2,Persons aged 15 years and over,1998Q1,Both sexes,In employment,1550.3
3,Persons aged 15 years and over,1998Q1,Both sexes,In employment full-time,1282.6
4,Persons aged 15 years and over,1998Q1,Both sexes,In employment part-time,267.7

----------------------------

,Statistic,Quarter,Sex,NACE Rev 2 Economic Sector,value
0,Persons aged 15-89 years in Employment,1998Q1,Both sexes,All NACE economic sectors,1550.3
1,Persons aged 15-89 years in Employment,1998Q1,Both sexes,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15-89 years in Employment,1998Q1,Both sexes,Construction (F),103.7
3,Persons aged 15-89 years in Employment,1998Q1,Both sexes,"Wholesale and retail trade, repair of motor ve...",219.5
4,Persons aged 15-89 years in Employment,1998Q1,Both sexes,Transportation and storage (H),65.6

----------------------------

,Statistic,Sex,NACE Rev 2 Economic Sector,Region,Quarter,value
0,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q1,1550.4
1,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q2,1572.1
2,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q3,1636.3
3,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q4,1615.9
4,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1999Q1,1644.5

----------------------------

,STATISTIC,Quarter,Sex,NACE Rev 2 Economic Sector,Region,value
0,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,State,1862.6
1,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,Border,145.1
2,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,West,175.8
3,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,Mid-West,188.8
4,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,South-East,153.3

----------------------------

,Statistic,Quarter,Region,value
0,Persons aged 15 years and over in Employment,2012Q1,State,1862.6
1,Persons aged 15 years and over in Employment,2012Q1,Northern and Western,320.9
2,Persons aged 15 years and over in Employment,2012Q1,Border,145.1
3,Persons aged 15 years and over in Employment,2012Q1,West,175.8
4,Persons aged 15 years and over in Employment,2012Q1,Southern,618.7

----------------------------

,Statistic,Quarter,Age Group,Sex,value
0,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Both sexes,140.2
1,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Male,83.8
2,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Female,56.4
3,Person aged 15 years and over in the Labour Force,1998Q1,15 - 24 years,Both sexes,389.8
4,Person aged 15 years and over in the Labour Force,1998Q1,15 - 24 years,Male,215.1

----------------------------

,STATISTIC,Quarter,Sex,Usual Hours Worked,value
0,Persons aged 15-89 years in Employment,1998Q1,Both sexes,1-9 hours,32.7
1,Persons aged 15-89 years in Employment,1998Q1,Both sexes,10-19 hours,80.8
2,Persons aged 15-89 years in Employment,1998Q1,Both sexes,20-29 hours,133.0
3,Persons aged 15-89 years in Employment,1998Q1,Both sexes,30-34 hours,47.1
4,Persons aged 15-89 years in Employment,1998Q1,Both sexes,35-39 hours,413.2

----------------------------

,Statistic,Nationality,NACE Rev 2 Economic Sector,Quarter,value
0,Persons aged 15 years and over in Employment,All nationalities,All NACE economic sectors,1998Q1,NaN
1,Persons aged 15 years and over in Employment,All nationalities,All NACE economic sectors,1998Q2,NaN
2,Persons aged 15 years and over in Employment,All nationalities,All NACE economic sectors,1998Q3,NaN
3,Persons aged 15 years and over in Employment,All nationalities,All NACE economic sectors,1998Q4,NaN
4,Persons aged 15 years and over in Employment,All nationalities,All NACE economic sectors,1999Q1,NaN

----------------------------

,Statistic,Quarter,Sex,Usual Hours Worked,value
0,Persons aged 15-89 years in Employment,1998Q1,Both sexes,0 - 9.5 hours,32.7
1,Persons aged 15-89 years in Employment,1998Q1,Both sexes,10 - 19.5 hours,80.8
2,Persons aged 15-89 years in Employment,1998Q1,Both sexes,20 - 29.5 hours,133.0
3,Persons aged 15-89 years in Employment,1998Q1,Both sexes,30 - 34.5 hours,47.1
4,Persons aged 15-89 years in Employment,1998Q1,Both sexes,35 - 39.5 hours,413.2

----------------------------

,Statistic,Nationality,ILO Economic Status,Quarter,value
0,Persons aged 15 years and over,All nationalities,All ILO economic status,1998Q1,NaN
1,Persons aged 15 years and over,All nationalities,All ILO economic status,1998Q2,NaN
2,Persons aged 15 years and over,All nationalities,All ILO economic status,1998Q3,NaN
3,Persons aged 15 years and over,All nationalities,All ILO economic status,1998Q4,NaN
4,Persons aged 15 years and over,All nationalities,All ILO economic status,1999Q1,NaN

----------------------------

,STATISTIC,Quarter,Broad NACE Rev 2 Economic Sector,Sex,value
0,Persons aged 15-89 years in Employment,1998Q1,All NACE economic sectors,Both sexes,1550.3
1,Persons aged 15-89 years in Employment,1998Q1,All NACE economic sectors,Male,934.9
2,Persons aged 15-89 years in Employment,1998Q1,All NACE economic sectors,Female,615.4
3,Persons aged 15-89 years in Employment,1998Q1,"Agriculture, forestry and fishing (A)",Both sexes,135.6
4,Persons aged 15-89 years in Employment,1998Q1,"Agriculture, forestry and fishing (A)",Male,117.5

----------------------------

,STATISTIC,Quarter,Sex,value
0,Average hours worked per week for persons aged...,1998Q1,Both sexes,38.3
1,Average hours worked per week for persons aged...,1998Q1,Male,42.3
2,Average hours worked per week for persons aged...,1998Q1,Female,32.8
3,Average hours worked per week for persons aged...,1998Q2,Both sexes,38.4
4,Average hours worked per week for persons aged...,1998Q2,Male,42.5

----------------------------

,STATISTIC,Quarter,Nationality,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment,1998Q1,All nationalities,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment,1998Q1,All nationalities,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment,1998Q1,All nationalities,Construction (F),103.7
3,Persons aged 15 years and over in Employment,1998Q1,All nationalities,Wholesale and retail trade; repair of motor ve...,219.5
4,Persons aged 15 years and over in Employment,1998Q1,All nationalities,Transportation and storage (H),65.6

----------------------------

,STATISTIC,Quarter,Nationality,ILO Economic Status,value
0,Persons aged 15 years and over,1998Q1,All nationalities,All ILO economic status,2857.2
1,Persons aged 15 years and over,1998Q1,All nationalities,In labour force,1699.0
2,Persons aged 15 years and over,1998Q1,All nationalities,In employment,1550.3
3,Persons aged 15 years and over,1998Q1,All nationalities,Unemployed,148.7
4,Persons aged 15 years and over,1998Q1,All nationalities,Not in labour force,1158.2

----------------------------

,Statistic,Quarter,NACE Rev 2 Economic Sector,value
0,Actual hours worked per week,1998Q1,All NACE economic sectors,56.7
1,Actual hours worked per week,1998Q1,"Agriculture, forestry and fishing (A)",7.1
2,Actual hours worked per week,1998Q1,Construction (F),4.0
3,Actual hours worked per week,1998Q1,"Wholesale and retail trade, repair of motor ve...",7.7
4,Actual hours worked per week,1998Q1,Transportation and storage (H),2.6

----------------------------

,Statistic,Quarter,NACE Rev 2 Economic Sector,Citizenship,value
0,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,All Countries,2259.9
1,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU14 excl Irl (countries in the EU pre 2004 ex...,60.7
2,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU15 to EU27 (accession countries joined post ...,137.1
3,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,United Kingdom,46.4
4,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,Ireland,1898.0

----------------------------

,Statistic,Quarter,ILO Economic Status,Citizenship,value
0,Persons aged 15 years and over,2021Q1,All ILO economic status,All Countries,4056.3
1,Persons aged 15 years and over,2021Q1,All ILO economic status,EU14 excl Irl (countries in the EU pre 2004 ex...,80.9
2,Persons aged 15 years and over,2021Q1,All ILO economic status,EU15 to EU27 (accession countries joined post ...,207.1
3,Persons aged 15 years and over,2021Q1,All ILO economic status,United Kingdom,91.3
4,Persons aged 15 years and over,2021Q1,All ILO economic status,Ireland,3478.3

----------------------------

,STATISTIC,Quarter,Age Group,value
0,Average hours worked per week for persons aged...,1998Q1,15 - 19 years,29.0
1,Average hours worked per week for persons aged...,1998Q1,15 - 64 years,38.2
2,Average hours worked per week for persons aged...,1998Q1,15 - 74 years,38.3
3,Average hours worked per week for persons aged...,1998Q1,15 years and over,38.3
4,Average hours worked per week for persons aged...,1998Q1,20 - 24 years,37.7

----------------------------

,Statistic,Quarter,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,"Crop and animal production, hunting and relate...",129.3
2,Persons aged 15 years and over in Employment (...,1998Q1,Forestry and logging (02),2.6
3,Persons aged 15 years and over in Employment (...,1998Q1,Fishing and aquaculture (03),3.7
4,Persons aged 15 years and over in Employment (...,1998Q1,Mining of coal and lignite (05),NaN

----------------------------

,Statistic,Quarter,Detailed Occupational Group,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All occupational groups,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,All occupational groups,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment (...,1998Q1,All occupational groups,Construction (F),103.7
3,Persons aged 15 years and over in Employment (...,1998Q1,All occupational groups,Wholesale and retail trade; repair of motor ve...,219.5
4,Persons aged 15 years and over in Employment (...,1998Q1,All occupational groups,Transportation and storage (H),65.6

----------------------------

,Statistic,Quarterly,Full and Part Time Status,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Construction (F),103.7
3,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Wholesale and retail trade; repair of motor ve...,219.5
4,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Transportation and storage (H),65.6

----------------------------

,Statistic,Quarter,Full and Part Time Status,Detailed Occupational Group,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,All occupational groups,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,"1 Managers, directors and senior officials",NaN
2,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,2 Professional,NaN
3,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,3 Associate professional and technical,NaN
4,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,4 Administrative and secreterial,NaN

----------------------------

,Statistic,Quarter,NACE Rev 2 Economic Sector,value
0,Average Usual Hours Worked per Week by Persons...,1998Q1,All NACE economic sectors,38.3
1,Average Usual Hours Worked per Week by Persons...,1998Q1,"Agriculture, forestry and fishing (A)",52.8
2,Average Usual Hours Worked per Week by Persons...,1998Q1,Construction (F),41.6
3,Average Usual Hours Worked per Week by Persons...,1998Q1,Wholesale and retail trade; repair of motor ve...,36.7
4,Average Usual Hours Worked per Week by Persons...,1998Q1,Transportation and storage (H),42.0

----------------------------

,Statistic,Quarter,Full and Part Time Status,value
0,Average Usual Hours Worked per Week by Persons...,1998Q1,All employment status,38.3
1,Average Usual Hours Worked per Week by Persons...,1998Q1,Full-time,42.5
2,Average Usual Hours Worked per Week by Persons...,1998Q1,Part-time,18.5
3,Average Usual Hours Worked per Week by Persons...,1998Q2,All employment status,38.4
4,Average Usual Hours Worked per Week by Persons...,1998Q2,Full-time,42.5

----------------------------

,Statistic,Quarter,Permanency of Employment,NACE Rev 2 Economic Sector,value
0,Employees aged 15 years and over in Employment...,1998Q1,All employees,All NACE economic sectors,1242.9
1,Employees aged 15 years and over in Employment...,1998Q1,All employees,"Agriculture, forestry and fishing (A)",24.4
2,Employees aged 15 years and over in Employment...,1998Q1,All employees,Construction (F),75.1
3,Employees aged 15 years and over in Employment...,1998Q1,All employees,Wholesale and retail trade; repair of motor ve...,175.7
4,Employees aged 15 years and over in Employment...,1998Q1,All employees,Transportation and storage (H),51.0

----------------------------
Attempt 1 failed: HTTPSConnectionPool(host='ws.cso.ie', port=443): Max retries exceeded with url: /public/api.restful/PxStat.Data.Cube_API.ReadDataset/QES20/JSON-stat/2.0/en (Caused by ConnectTimeoutError(<urllib3.connection.HTTPSConnection object at 0x000001CFB447BD90>, 'Connection to ws.cso.ie timed out. (connect timeout=15)'))

,Statistic,Quarter,Extent of working at home,value
0,Persons aged 15 years and over in employment (...,1998Q1,Person usually works at home,NaN
1,Persons aged 15 years and over in employment (...,1998Q1,Person sometimes works at home,NaN
2,Persons aged 15 years and over in employment (...,1998Q1,Person never works at home,NaN
3,Persons aged 15 years and over in employment (...,1998Q1,Not stated,1550.3
4,Persons aged 15 years and over in employment (...,1998Q1,All persons in employment,1550.3

----------------------------

,Statistic,Quarter,NUTS3 regions,Extent of working at home,value
0,Persons aged 15 years and over in employment (...,2001Q1,Border,Person usually works at home,27.1
1,Persons aged 15 years and over in employment (...,2001Q1,Border,Person sometimes works at home,17.1
2,Persons aged 15 years and over in employment (...,2001Q1,Border,Person never works at home,142.3
3,Persons aged 15 years and over in employment (...,2001Q1,Border,Not stated,4.6
4,Persons aged 15 years and over in employment (...,2001Q1,Border,All persons in employment,191.1

----------------------------

,Statistic,Quarter,NACE Rev 2 Economic Sector,value
0,Students aged 15 years and over in employment ...,1998Q1,All NACE economic sectors,54.1
1,Students aged 15 years and over in employment ...,1998Q1,"Agriculture, forestry and fishing (A)",3.0
2,Students aged 15 years and over in employment ...,1998Q1,Construction (F),NaN
3,Students aged 15 years and over in employment ...,1998Q1,Wholesale and retail trade; repair of motor ve...,21.8
4,Students aged 15 years and over in employment ...,1998Q1,Transportation and storage (H),NaN

----------------------------

,Statistic,Quarter,Full and Part Time Status,Sex,value
0,Persons in employment (ILO),1998Q1,All employment status,Both sexes,1550.3
1,Persons in employment (ILO),1998Q1,All employment status,Male,934.9
2,Persons in employment (ILO),1998Q1,All employment status,Female,615.4
3,Persons in employment (ILO),1998Q1,Full-time,Both sexes,1282.6
4,Persons in employment (ILO),1998Q1,Full-time,Male,856.0

----------------------------

,Statistic,Quarter,Reasons for being in Part-Time Employment,Sex,value
0,Persons aged 15 years and over in Part-Time Em...,1998Q1,All reasons for being in part-time employment,Both sexes,267.7
1,Persons aged 15 years and over in Part-Time Em...,1998Q1,All reasons for being in part-time employment,Male,78.9
2,Persons aged 15 years and over in Part-Time Em...,1998Q1,All reasons for being in part-time employment,Female,188.9
3,Persons aged 15 years and over in Part-Time Em...,1998Q1,"School, education or training",Both sexes,51.7
4,Persons aged 15 years and over in Part-Time Em...,1998Q1,"School, education or training",Male,26.0

----------------------------

QLF01 - ADULTS, SINCE 1998, SEX, ILO
QLF03 - ADULTS IN EMPLOYMENT, SINCE 1998, SEX, SECTOR
QLF05 - ADULTS IN EMPLOYMENT, SINCE 1998, SEX, SECTOR, REGION
QLF07 - ADULTS IN EMPLOYMENT, SINCE 2012, SEX, SECTOR, REGION
QLF08 - ADULTS IN EMPLOYMENT, SINCE 2012, REGION
QLF18 - ADULTS IN LABOUR FORCE, SINCE 1998, AGE GROUP, SEX
QLF20 - ADULTS IN EMPLOYMENT, SINCE 1998, SEX, USUAL HOURS WORKED
QLF21 - ADULTS IN EMPLOYMENT, SINCE 1998, NATIONALITY, SECTOR
QLF25 - ADULTS IN EMPLOYMENT, SINCE 1998, SEX, USUAL HOURS WORKED
QLF26 - ADULTS, SINCE 1998, ILO
QLF32 - ADULTS IN EMPLOYMENT, SINCE 1998, SECTOR, SEX
QLF33 - AVERAGE HOURS WORKED FOR ADULTS, SINCE 1998, SEX
QLF34 - ADULTS IN EMPLOYMENT, SINCE 1998, NATIONALITY, SECTOR
QLF35 - ADULTS, SINCE 1998, NATIONALITY, ILO
QLF36 - ACTUAL HOURS WORKED PER WEEK, SINCE 1998, SECTOR
QLF47 - ADULTS IN EMPLOYMENT, SINCE 2021, CITIZENSHIP, SECTOR
QLF48 - ADULTS, SINCE 2021, CITIZENSHIP, ILO
QLF49 - AVERAGE HOURS WORKED FOR ADULTS, SINCE 1998, AGE GROUP
QES01 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, SECTOR
QES03 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, OCCUPATIONAL GROUP, SECTOR
QES06 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, FULL/PART TIME STATUS, SECTOR
QES07 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, FULL/PART TIME STATUS, OCCUPATIONAL GROUP
QES08 - AVERAGE USUAL HOURS WORKED PER WEEK, SINCE 1998, SECTOR
QES11 - AVERAGE USUAL HOURS WORKED PER WEEK, SINCE 1998, FULL/PART TIME STATUS
QES15 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, PERMANENCY, SECTOR
QES20 - ADULTS IN EMPLOYMENT (ILO), SINCE 1998, EXTENT OF WORKING AT HOME
QES21 - ADULTS IN EMPLOYMENT (ILO), SINCE 2001, NUTS3 REGION, EXTENT OF WORKING AT HOME
QES22 - STUDENTS IN EMPLOYMENT, SINCE 1998, SECTOR
QES24 - PERSONS IN EMPLOYMENT (ILO), SINCE 1998, FULL/PART TIME STATUS, SEX
QES25 - ADULTS IN PART-TIME EMPLOYMENT, SINCE 1998, REASON FOR PART TIME EMPLOYMENT, SEX

In [5]:
df_to_use

{'QLF01':                            Statistic Quarter         Sex  \
 0     Persons aged 15 years and over  1998Q1  Both sexes
 1     Persons aged 15 years and over  1998Q1  Both sexes
 2     Persons aged 15 years and over  1998Q1  Both sexes
 3     Persons aged 15 years and over  1998Q1  Both sexes
 4     Persons aged 15 years and over  1998Q1  Both sexes
 ...                              ...     ...         ...
 4573  Persons aged 15 years and over  2025Q1      Female
 4574  Persons aged 15 years and over  2025Q1      Female
 4575  Persons aged 15 years and over  2025Q1      Female
 4576  Persons aged 15 years and over  2025Q1      Female
 4577  Persons aged 15 years and over  2025Q1      Female

                            ILO Economic Status   value
 0                      All ILO economic status  2857.2
 1                              In labour force  1699.0
 2                                In employment  1550.3
 3                      In employment full-time  1282.6
 4                      In employment part-time   267.7
 ...                                        ...     ...
 4573         Unemployed seeking part-time work    25.5
 4574                       Not in labour force   874.4
 4575         Potential additional labour force    64.5
 4576                Others not in labour force   809.9
 4577  Unemployed seeking work as self-employed     NaN

 [4578 rows x 5 columns],
 'QLF03':                                                Statistic Quarter         Sex  \
 0                 Persons aged 15-89 years in Employment  1998Q1  Both sexes
 1                 Persons aged 15-89 years in Employment  1998Q1  Both sexes
 2                 Persons aged 15-89 years in Employment  1998Q1  Both sexes
 3                 Persons aged 15-89 years in Employment  1998Q1  Both sexes
 4                 Persons aged 15-89 years in Employment  1998Q1  Both sexes
 ...                                                  ...     ...         ...
 11767  Persons aged 15-89 years in Employment (Season...  2025Q1      Female
 11768  Persons aged 15-89 years in Employment (Season...  2025Q1      Female
 11769  Persons aged 15-89 years in Employment (Season...  2025Q1      Female
 11770  Persons aged 15-89 years in Employment (Season...  2025Q1      Female
 11771  Persons aged 15-89 years in Employment (Season...  2025Q1      Female

                               NACE Rev 2 Economic Sector   value
 0                              All NACE economic sectors  1550.3
 1                  Agriculture, forestry and fishing (A)   135.6
 2                                       Construction (F)   103.7
 3      Wholesale and retail trade, repair of motor ve...   219.5
 4                         Transportation and storage (H)    65.6
 ...                                                  ...     ...
 11767                 Industry and Construction (B to F)     NaN
 11768                                  Services (G to U)     NaN
 11769  Financial, insurance and real estate activitie...    72.4
 11770                     Other NACE activities (R to U)    71.8
 11771                                         Not stated     NaN

 [11772 rows x 5 columns],
 'QLF05':                                           Statistic         Sex  \
 0      Person aged 15 years and over in Employment   Both sexes
 1      Person aged 15 years and over in Employment   Both sexes
 2      Person aged 15 years and over in Employment   Both sexes
 3      Person aged 15 years and over in Employment   Both sexes
 4      Person aged 15 years and over in Employment   Both sexes
 ...                                             ...         ...
 27211  Person aged 15 years and over in Employment       Female
 27212  Person aged 15 years and over in Employment       Female
 27213  Person aged 15 years and over in Employment       Female
 27214  Person aged 15 years and over in Employment       Female
 27215  Person aged 15 years and over in Employment       Female

       NACE Rev 2 Economic Sector      Region Quarter   value
 0      All NACE economic sectors       State  1998Q1  1550.4
 1      All NACE economic sectors       State  1998Q2  1572.1
 2      All NACE economic sectors       State  1998Q3  1636.3
 3      All NACE economic sectors       State  1998Q4  1615.9
 4      All NACE economic sectors       State  1999Q1  1644.5
 ...                          ...         ...     ...     ...
 27211                 Not stated  South-West  2010Q4     NaN
 27212                 Not stated  South-West  2011Q1     NaN
 27213                 Not stated  South-West  2011Q2     NaN
 27214                 Not stated  South-West  2011Q3     NaN
 27215                 Not stated  South-West  2011Q4     NaN

 [27216 rows x 6 columns],
 'QLF07':                                     STATISTIC Quarter         Sex  \
 0      Persons aged 15-89 years in Employment  2012Q1  Both sexes
 1      Persons aged 15-89 years in Employment  2012Q1  Both sexes
 2      Persons aged 15-89 years in Employment  2012Q1  Both sexes
 3      Persons aged 15-89 years in Employment  2012Q1  Both sexes
 4      Persons aged 15-89 years in Employment  2012Q1  Both sexes
 ...                                       ...     ...         ...
 25753  Persons aged 15-89 years in Employment  2025Q1      Female
 25754  Persons aged 15-89 years in Employment  2025Q1      Female
 25755  Persons aged 15-89 years in Employment  2025Q1      Female
 25756  Persons aged 15-89 years in Employment  2025Q1      Female
 25757  Persons aged 15-89 years in Employment  2025Q1      Female

       NACE Rev 2 Economic Sector      Region   value
 0      All NACE economic sectors       State  1862.6
 1      All NACE economic sectors      Border   145.1
 2      All NACE economic sectors        West   175.8
 3      All NACE economic sectors    Mid-West   188.8
 4      All NACE economic sectors  South-East   153.3
 ...                          ...         ...     ...
 25753                 Not stated  South-East     NaN
 25754                 Not stated  South-West     NaN
 25755                 Not stated      Dublin     NaN
 25756                 Not stated    Mid-East     NaN
 25757                 Not stated     Midland     NaN

 [25758 rows x 6 columns],
 'QLF08':                                          Statistic Quarter  \
 0     Persons aged 15 years and over in Employment  2012Q1
 1     Persons aged 15 years and over in Employment  2012Q1
 2     Persons aged 15 years and over in Employment  2012Q1
 3     Persons aged 15 years and over in Employment  2012Q1
 4     Persons aged 15 years and over in Employment  2012Q1
 ...                                            ...     ...
 3175    ILO Participation Rate (15 years and over)  2025Q1
 3176    ILO Participation Rate (15 years and over)  2025Q1
 3177    ILO Participation Rate (15 years and over)  2025Q1
 3178    ILO Participation Rate (15 years and over)  2025Q1
 3179    ILO Participation Rate (15 years and over)  2025Q1

                     Region   value
 0                    State  1862.6
 1     Northern and Western   320.9
 2                   Border   145.1
 3                     West   175.8
 4                 Southern   618.7
 ...                    ...     ...
 3175            South-West    65.1
 3176   Eastern and Midland    67.5
 3177                Dublin    68.9
 3178              Mid-East    67.0
 3179               Midland    61.9

 [3180 rows x 4 columns],
 'QLF18':                                                Statistic Quarter  \
 0      Person aged 15 years and over in the Labour Force  1998Q1
 1      Person aged 15 years and over in the Labour Force  1998Q1
 2      Person aged 15 years and over in the Labour Force  1998Q1
 3      Person aged 15 years and over in the Labour Force  1998Q1
 4      Person aged 15 years and over in the Labour Force  1998Q1
 ...                                                  ...     ...
 25501             ILO Unemployment Rates (15 - 74 years)  2025Q1
 25502             ILO Unemployment Rates (15 - 74 years)  2025Q1
 25503             ILO Unemployment Rates (15 - 74 years)  2025Q1
 25504             ILO Unemployment Rates (15 - 74 years)  2025Q1
 25505             ILO Unemployment Rates (15 - 74 years)  2025Q1

                Age Group         Sex  value
 0          15 - 19 years  Both sexes  140.2
 1          15 - 19 years        Male   83.8
 2          15 - 19 years      Female   56.4
 3          15 - 24 years  Both sexes  389.8
 4          15 - 24 years        Male  215.1
 ...                  ...         ...    ...
 25501  65 years and over        Male    1.3
 25502  65 years and over      Female    2.6
 25503      25 - 74 years  Both sexes    3.6
 25504      25 - 74 years        Male    3.7
 25505      25 - 74 years      Female    3.4

 [25506 rows x 5 columns],
 'QLF20':                                    STATISTIC Quarter         Sex  \
 0     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 1     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 2     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 3     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 4     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 ...                                      ...     ...         ...
 2395  Persons aged 15-89 years in Employment  2022Q4      Female
 2396  Persons aged 15-89 years in Employment  2022Q4      Female
 2397  Persons aged 15-89 years in Employment  2022Q4      Female
 2398  Persons aged 15-89 years in Employment  2022Q4      Female
 2399  Persons aged 15-89 years in Employment  2022Q4      Female

              Usual Hours Worked  value
 0                     1-9 hours   32.7
 1                   10-19 hours   80.8
 2                   20-29 hours  133.0
 3                   30-34 hours   47.1
 4                   35-39 hours  413.2
 ...                         ...    ...
 2395                30-34 hours  105.9
 2396                35-39 hours  369.8
 2397                40-44 hours  227.0
 2398          45 hours and over   90.1
 2399  Variable hours (see note)   30.8

 [2400 rows x 5 columns],
 'QLF21':                                          Statistic          Nationality  \
 0     Persons aged 15 years and over in Employment    All nationalities
 1     Persons aged 15 years and over in Employment    All nationalities
 2     Persons aged 15 years and over in Employment    All nationalities
 3     Persons aged 15 years and over in Employment    All nationalities
 4     Persons aged 15 years and over in Employment    All nationalities
 ...                                            ...                  ...
 9851  Persons aged 15 years and over in Employment  EU15 to EU28 states
 9852  Persons aged 15 years and over in Employment  EU15 to EU28 states
 9853  Persons aged 15 years and over in Employment  EU15 to EU28 states
 9854  Persons aged 15 years and over in Employment  EU15 to EU28 states
 9855  Persons aged 15 years and over in Employment  EU15 to EU28 states

      NACE Rev 2 Economic Sector Quarter  value
 0     All NACE economic sectors  1998Q1    NaN
 1     All NACE economic sectors  1998Q2    NaN
 2     All NACE economic sectors  1998Q3    NaN
 3     All NACE economic sectors  1998Q4    NaN
 4     All NACE economic sectors  1999Q1    NaN
 ...                         ...     ...    ...
 9851                 Not stated  2018Q4    NaN
 9852                 Not stated  2019Q1    NaN
 9853                 Not stated  2019Q2    NaN
 9854                 Not stated  2019Q3    NaN
 9855                 Not stated  2019Q4    NaN

 [9856 rows x 5 columns],
 'QLF25':                                    Statistic Quarter         Sex  \
 0     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 1     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 2     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 3     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 4     Persons aged 15-89 years in Employment  1998Q1  Both sexes
 ...                                      ...     ...         ...
 2611  Persons aged 15-89 years in Employment  2025Q1      Female
 2612  Persons aged 15-89 years in Employment  2025Q1      Female
 2613  Persons aged 15-89 years in Employment  2025Q1      Female
 2614  Persons aged 15-89 years in Employment  2025Q1      Female
 2615  Persons aged 15-89 years in Employment  2025Q1      Female

              Usual Hours Worked  value
 0                 0 - 9.5 hours   32.7
 1               10 - 19.5 hours   80.8
 2               20 - 29.5 hours  133.0
 3               30 - 34.5 hours   47.1
 4               35 - 39.5 hours  413.2
 ...                         ...    ...
 2611            30 - 34.5 hours  122.8
 2612            35 - 39.5 hours  438.8
 2613            40 - 44.5 hours  236.6
 2614          45 hours and over   79.4
 2615  Variable Hours (see note)   19.1

 [2616 rows x 5 columns],
 'QLF26':                            Statistic          Nationality  \
 0     Persons aged 15 years and over    All nationalities
 1     Persons aged 15 years and over    All nationalities
 2     Persons aged 15 years and over    All nationalities
 3     Persons aged 15 years and over    All nationalities
 4     Persons aged 15 years and over    All nationalities
 ...                              ...                  ...
 3075  Persons aged 15 years and over  EU15 to EU28 states
 3076  Persons aged 15 years and over  EU15 to EU28 states
 3077  Persons aged 15 years and over  EU15 to EU28 states
 3078  Persons aged 15 years and over  EU15 to EU28 states
 3079  Persons aged 15 years and over  EU15 to EU28 states

           ILO Economic Status Quarter  value
 0     All ILO economic status  1998Q1    NaN
 1     All ILO economic status  1998Q2    NaN
 2     All ILO economic status  1998Q3    NaN
 3     All ILO economic status  1998Q4    NaN
 4     All ILO economic status  1999Q1    NaN
 ...                       ...     ...    ...
 3075      Not in labour force  2018Q4   42.9
 3076      Not in labour force  2019Q1   44.0
 3077      Not in labour force  2019Q2   47.8
 3078      Not in labour force  2019Q3   42.2
 3079      Not in labour force  2019Q4   47.7

 [3080 rows x 5 columns],
 'QLF32':                                    STATISTIC Quarter  \
 0     Persons aged 15-89 years in Employment  1998Q1
 1     Persons aged 15-89 years in Employment  1998Q1
 2     Persons aged 15-89 years in Employment  1998Q1
 3     Persons aged 15-89 years in Employment  1998Q1
 4     Persons aged 15-89 years in Employment  1998Q1
 ...                                      ...     ...
 1303  Persons aged 15-89 years in Employment  2025Q1
 1304  Persons aged 15-89 years in Employment  2025Q1
 1305  Persons aged 15-89 years in Employment  2025Q1
 1306  Persons aged 15-89 years in Employment  2025Q1
 1307  Persons aged 15-89 years in Employment  2025Q1

            Broad NACE Rev 2 Economic Sector         Sex   value
 0                 All NACE economic sectors  Both sexes  1550.3
 1                 All NACE economic sectors        Male   934.9
 2                 All NACE economic sectors      Female   615.4
 3     Agriculture, forestry and fishing (A)  Both sexes   135.6
 4     Agriculture, forestry and fishing (A)        Male   117.5
 ...                                     ...         ...     ...
 1303     Industry and Construction (B to F)        Male   387.8
 1304     Industry and Construction (B to F)      Female   122.6
 1305                      Services (G to U)  Both sexes  2169.7
 1306                      Services (G to U)        Male   988.4
 1307                      Services (G to U)      Female  1181.3

 [1308 rows x 5 columns],
 'QLF33':                                              STATISTIC Quarter         Sex  \
 0    Average hours worked per week for persons aged...  1998Q1  Both sexes
 1    Average hours worked per week for persons aged...  1998Q1        Male
 2    Average hours worked per week for persons aged...  1998Q1      Female
 3    Average hours worked per week for persons aged...  1998Q2  Both sexes
 4    Average hours worked per week for persons aged...  1998Q2        Male
 ..                                                 ...     ...         ...
 322  Average hours worked per week for persons aged...  2024Q4        Male
 323  Average hours worked per week for persons aged...  2024Q4      Female
 324  Average hours worked per week for persons aged...  2025Q1  Both sexes
 325  Average hours worked per week for persons aged...  2025Q1        Male
 326  Average hours worked per week for persons aged...  2025Q1      Female

      value
 0     38.3
 1     42.3
 2     32.8
 3     38.4
 4     42.5
 ..     ...
 322   38.4
 323   32.0
 324   35.3
 325   38.5
 326   31.7

 [327 rows x 4 columns],
 'QLF34':                                           STATISTIC Quarter  \
 0      Persons aged 15 years and over in Employment  1998Q1
 1      Persons aged 15 years and over in Employment  1998Q1
 2      Persons aged 15 years and over in Employment  1998Q1
 3      Persons aged 15 years and over in Employment  1998Q1
 4      Persons aged 15 years and over in Employment  1998Q1
 ...                                             ...     ...
 10299  Persons aged 15 years and over in Employment  2020Q4
 10300  Persons aged 15 years and over in Employment  2020Q4
 10301  Persons aged 15 years and over in Employment  2020Q4
 10302  Persons aged 15 years and over in Employment  2020Q4
 10303  Persons aged 15 years and over in Employment  2020Q4

                    Nationality  \
 0            All nationalities
 1            All nationalities
 2            All nationalities
 3            All nationalities
 4            All nationalities
 ...                        ...
 10299  Other nationalities (7)
 10300  Other nationalities (7)
 10301  Other nationalities (7)
 10302  Other nationalities (7)
 10303  Other nationalities (7)

                               NACE Rev 2 Economic Sector   value
 0                              All NACE economic sectors  1550.3
 1                  Agriculture, forestry and fishing (A)   135.6
 2                                       Construction (F)   103.7
 3      Wholesale and retail trade; repair of motor ve...   219.5
 4                         Transportation and storage (H)    65.6
 ...                                                  ...     ...
 10299        Human health and social work activities (Q)    21.7
 10300                                  Industry (B to E)     NaN
 10301  Financial, insurance and real estate activitie...     NaN
 10302                     Other NACE activities (R to U)     NaN
 10303                                         Not stated     NaN

 [10304 rows x 5 columns],
 'QLF35':                            STATISTIC Quarter              Nationality  \
 0     Persons aged 15 years and over  1998Q1        All nationalities
 1     Persons aged 15 years and over  1998Q1        All nationalities
 2     Persons aged 15 years and over  1998Q1        All nationalities
 3     Persons aged 15 years and over  1998Q1        All nationalities
 4     Persons aged 15 years and over  1998Q1        All nationalities
 ...                              ...     ...                      ...
 3215  Persons aged 15 years and over  2020Q4  Other nationalities (7)
 3216  Persons aged 15 years and over  2020Q4  Other nationalities (7)
 3217  Persons aged 15 years and over  2020Q4  Other nationalities (7)
 3218  Persons aged 15 years and over  2020Q4  Other nationalities (7)
 3219  Persons aged 15 years and over  2020Q4  Other nationalities (7)

           ILO Economic Status   value
 0     All ILO economic status  2857.2
 1             In labour force  1699.0
 2               In employment  1550.3
 3                  Unemployed   148.7
 4         Not in labour force  1158.2
 ...                       ...     ...
 3215  All ILO economic status   196.2
 3216          In labour force   133.7
 3217            In employment   121.0